app/views/challenges/show.html.erb

SELECT SUM("pledges"."amount") FROM "pledges" WHERE "pledges"."challenge_id" = $1  [["challenge_id", 80]]
SELECT "pledges".* FROM "pledges" WHERE "pledges"."challenge_id" = $1
---
<h2>Amount Raised</h2>
$<%= @challenge.pledges.sum :amount %>