app/controllers/challenges_controller.rb

  def index
    @challenges = Challenge.all
---
SELECT "challenges".* FROM "challenges"

  def my_index
    @challenges = Challenge.where :user_id => @current_user.id
---
SELECT "challenges".* FROM "challenges" WHERE "challenges"."user_id" = $1  [["user_id", 25]]

  def create
    @challenge = Challenge.new challenge_params

    if @challenge.save
---
INSERT INTO "challenges" ("title", "description", "nominee_name", "nominee_email", "banner_image", "cause", "target", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"

  def accept
    @challenge = Challenge.find(params[:challenge_id])
    @challenge.update :accepted_date => Time.now
---
SELECT  "challenges".* FROM "challenges" WHERE "challenges"."id" = $1 LIMIT 1
UPDATE "challenges" SET "user_id" = $1, "updated_at" = $2 WHERE "challenges"."id" = $3

  def edit
    @challenge = Challenge.find params[:id]
---
SELECT  "challenges".* FROM "challenges" WHERE "challenges"."id" = $1 LIMIT 1

  def show
    @challenge = Challenge.find params[:id]
---
SELECT  "challenges".* FROM "challenges" WHERE "challenges"."id" = $1 LIMIT 1  [["id", 5]]

  def update
    @challenge = Challenge.find params[:id]
    unless @challenge.is_owner?(@current_user)
      redirect_to root_path
    end

    if @challenge.update challenge_params
---
SELECT  "challenges".* FROM "challenges" WHERE "challenges"."id" = $1 LIMIT 1  [["id", 9]]
UPDATE "challenges" SET "banner_image" = $1, "updated_at" = $2 WHERE "challenges"."id" = $3  [["banner_image", "image-guitar.jpg"], ["updated_at", "2015-02-11 03:53:58.232164"], ["id", 14]]

  def destroy
    challenge = Challenge.find params[:id]

    unless @challenge.is_owner?(@current_user)
      redirect_to root_path
    end

    challenge.destroy
---
SELECT  "challenges".* FROM "challenges" WHERE "challenges"."id" = $1 LIMIT 1  [["id", 7]]
DELETE FROM "challenges" WHERE "challenges"."id" = $1  [["id", 7]]