app/controllers/pledges_controller.rb

  def new
    @challenge = Challenge.find params[:challenge_id]
---
SELECT  "challenges".* FROM "challenges" WHERE "challenges"."id" = $1 LIMIT 1

  def create

    @challenge = Challenge.find params[:challenge_id]
    @pledge = @challenge.pledges.new pledge_params
    if @pledge.save
---
SELECT  "challenges".* FROM "challenges" WHERE "challenges"."id" = $1 LIMIT 1
INSERT INTO "pledges" ("amount", "reason", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"

  def pay
    @user = @current_user
    @challenge = Challenge.find params[:challenge_id]
    @pledge = Pledge.find params[:pledge_id]
---
SELECT  "challenges".* FROM "challenges" WHERE "challenges"."id" = $1 LIMIT 1  [["id", 80]]
SELECT  "pledges".* FROM "pledges" WHERE "pledges"."id" = $1 LIMIT 1  [["id", 34]]

  def charge
    @challenge = Challenge.find params[:challenge_id]
    @pledge = Pledge.find params[:pledge_id]
---
SELECT  "challenges".* FROM "challenges" WHERE "challenges"."id" = $1 LIMIT 1  [["id", 20]]
SELECT  "pledges".* FROM "pledges" WHERE "pledges"."id" = $1 LIMIT 1  [["id", 57]]

  def index
    @challenge = Challenge.find params[:challenge_id]
---
SELECT  "challenges".* FROM "challenges" WHERE "challenges"."id" = $1 LIMIT 1  [["id", 11]]