app/controllers/pledges_controller.rb

  def create
    @challenge = Challenge.find params[:challenge_id]
    @pledge = Pledge.new pledge_params
    if @pledge.save
      @pledge.update(:user_id => @current_user.id, :challenge_id => @challenge.id)
---
UPDATE "pledges" SET "user_id" = $1, "challenge_id" = $2, "updated_at" = $3 WHERE "pledges"."id" = $4