app/controllers/users_controller.rb

  def create
    @user = User.new user_params
    if @user.save
---
INSERT INTO "users" ("name", "email", "profile_image", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

  def edit
    @user = User.find params[:id]
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1

  def update
    @user = User.find params[:id]
    @user.update user_params
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 25]]
UPDATE "users" SET "name" = $1, "profile_image" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["name", "Joel Turnbull"], ["profile_image", "https://ga-core.s3.amazonaws.com/production/uploads/instructor/image/1051/thumb_joel.jpg"], ["updated_at", "2015-02-10 06:23:18.068338"], ["id", 26]]